# Pandas Veri Analizi - U.S Major League Soccer Salaries Veri Analizi

In [1]:
import numpy as np
import pandas as pd

In [3]:
soccer = pd.read_csv("original.csv")

In [4]:
soccer

,club,last_name,first_name,position,base_salary,guaranteed_compensation
0,ATL,Almiron,Miguel,M,1912500.0,2297000.00
1,ATL,Ambrose,Mikey,D,65625.0,65625.00
2,ATL,Asad,Yamil,M,150000.0,150000.00
3,ATL,Bloom,Mark,D,99225.0,106573.89
4,ATL,Carleton,Andrew,F,65000.0,77400.00
...,...,...,...,...,...,...
611,VAN,Tornaghi,Paolo,GK,80000.0,80000.00
612,VAN,Waston,Kendall,D,350000.0,368125.00
613,VAN,Williams,Sheanon,D,175000.0,184000.00
614,NaN,Babouli,Mo,F,54075.0,54075.00
615,NaN,Ramajo,David Mateos,D,420000.0,453333.33

In [7]:
soccer.head( n = 10)

,club,last_name,first_name,position,base_salary,guaranteed_compensation
0,ATL,Almiron,Miguel,M,1912500.0,2297000.00
1,ATL,Ambrose,Mikey,D,65625.0,65625.00
2,ATL,Asad,Yamil,M,150000.0,150000.00
3,ATL,Bloom,Mark,D,99225.0,106573.89
4,ATL,Carleton,Andrew,F,65000.0,77400.00
5,ATL,Carmona,Carlos,M,675000.0,725000.00
6,ATL,Garza,Greg,D,150000.0,150000.00
7,ATL,Gonzalez Pirez,Leandro,D,250008.0,285008.00
8,ATL,Goslin,Chris,M,70000.0,74000.00
9,ATL,Gressel,Julian,M,75000.0,93750.00

In [10]:
len(soccer)

616

In [11]:
soccer["base_salary"].mean()

296977.73686688306

In [12]:
soccer["base_salary"].max()

6660000.0

In [13]:
soccer["guaranteed_compensation"].max()

7167500.0

In [17]:
soccer["guaranteed_compensation"]

0      2297000.00
1        65625.00
2       150000.00
3       106573.89
4        77400.00
          ...
611      80000.00
612     368125.00
613     184000.00
614      54075.00
615     453333.33
Name: guaranteed_compensation, Length: 616, dtype: float64

In [15]:
soccer["guaranteed_compensation"].max() == soccer["guaranteed_compensation"]

0      False
1      False
2      False
3      False
4      False
       ...
611    False
612    False
613    False
614    False
615    False
Name: guaranteed_compensation, Length: 616, dtype: bool

In [18]:
soccer["guaranteed_compensation"] == soccer["guaranteed_compensation"].max()

0      False
1      False
2      False
3      False
4      False
       ...
611    False
612    False
613    False
614    False
615    False
Name: guaranteed_compensation, Length: 616, dtype: bool

In [19]:
soccer[soccer["guaranteed_compensation"] == soccer["guaranteed_compensation"].max()]

    club last_name first_name position  base_salary  guaranteed_compensation
401  ORL      Kaka        NaN        M    6660000.0                7167500.0

In [20]:
soccer[soccer["guaranteed_compensation"] == soccer["guaranteed_compensation"].max()]["last_name"]

401    Kaka
Name: last_name, dtype: object

In [21]:
soccer[soccer["last_name"] == "Gonzalez Pirez"]["position"]

7    D
Name: position, dtype: object

In [26]:
soccer[soccer["last_name"] == "Gonzalez Pirez"]["position"].iloc[0]

'D'

In [27]:
soccer.groupby("position").mean()

            base_salary  guaranteed_compensation
position
D         166574.093784            179533.184811
D-M       134930.000000            154328.927857
F         489588.598349            557437.206514
F-M       335834.000000            367920.805000
F/M       125000.000000            131250.000000
GK        146472.515538            158665.155692
M         376106.218632            406781.788396
M-D       219032.250000            230282.250000
M-F       212975.604211            231104.551579
M/F       550000.000000            565000.000000

In [29]:
soccer["position"].unique()

array(['M', 'D', 'F', 'GK', 'M-F', 'F-M', 'D-M', 'M-D', 'M/F', 'F/M'],
      dtype=object)

In [30]:
soccer["position"].nunique()

10

In [31]:
soccer["position"].value_counts()

M      212
D      185
F      109
GK      65
M-F     19
D-M     14
F-M      6
M-D      4
M/F      1
F/M      1
Name: position, dtype: int64

In [33]:
soccer["club"].value_counts()

VAN      32
PHI      31
ATL      31
CLB      30
ORL      30
SJ       29
DAL      29
NYCFC    28
NYRB     28
HOU      28
RSL      27
CHI      27
POR      27
DC       27
TOR      27
MNUFC    27
MTL      27
LA       27
KC       26
COL      26
SEA      25
NE       23
LAFC      2
Name: club, dtype: int64

In [35]:
def re_find(last_name):
    if "son" in last_name.lower():
        return True
    return False

soccer[soccer["last_name"].apply(re_find)]

,club,last_name,first_name,position,base_salary,guaranteed_compensation
21,ATL,Peterson,Jacob,F,165300.00,165300.00
23,ATL,Robinson,Miles,D,125000.04,195000.04
45,CHI,Johnson,Daniel,M,65004.00,65004.00
48,CHI,Lampson,Matt,GK,76000.00,81375.00
85,CLB,Swanson,Ben,M,85000.00,105416.67
163,DC,Robinson,Jalen,D,69996.00,69996.00
233,LA,Jamieson,Bradford,F,66150.00,66150.00
265,MNUFC,Ibson,NaN,M,200004.00,210337.40
276,MNUFC,Thiesson,Jerome,D,171000.00,210166.67
295,MTL,Jackson-Hamel,Anthony,F,66150.00,66150.00
327,NE,Watson,Je-Vaughn,D-M,150000.00,155666.67
338,NYCFC,Harrison,Jack,M,130000.00,165500.00
341,NYCFC,Johnson,Sean,GK,220008.00,220008.00
400,ORL,Johnson,Will,M,414000.00,450000.00
442,PHI,Simpson,Jay,F,465000.00,508333.33
459,POR,Gleeson,Jake,GK,110000.00,115166.67
522,SEA,Svensson,Gustav,M,170000.04,170000.04
550,SJ,Thompson,Tommy,M,150000.00,155000.00
594,VAN,Jacobson,Andrew,M,150000.00,175000.00